In [2]:
# Import Libraries
import pandas as pd
import numpy as np
import os
import matplotlib.pyplot as plt
import seaborn as sns
import scipy

In [3]:
# Set Path
path=r'C:\\\\Users\\\\maad0\\\\OneDrive\\\\CAREERFOUNDRY Notes\\\\Python Fundamentals for Data Analyst\\\\08-2023 Instacart Basket Analysis'

In [12]:
# Import Dataset customers.csv
customers_df2 = pd.read_csv(os.path.join(path, '02 Data', 'Original Data', 'customers.csv'), index_col = False)

### Question 4. Wrangle the data so that it follows consistent logic; for example, rename columns with illogical names and drop columns that don't add anything to your analysis.

In [13]:
# Renaming Columns
customers_df2.rename(columns = {'First Name' : 'first_name'}, inplace = True)

In [14]:
customers_df2.rename(columns = {'Surnam': 'last_name'}, inplace = True)

In [15]:
customers_df2.rename(columns = {'Gender': 'gender'}, inplace = True)

In [16]:
customers_df2.rename(columns = {'STATE': 'state'}, inplace = True)

In [17]:
customers_df2.rename(columns = {'Age' : 'age'}, inplace = True)

In [18]:
customers_df2.rename(columns = {'n_dependants': 'num_dependants'}, inplace = True)

In [19]:
# Checking results
customers_df2.columns

Index(['user_id', 'first_name', 'last_name', 'gender', 'state', 'age',
       'date_joined', 'num_dependants', 'fam_status', 'income'],
      dtype='object')

In [20]:
# Checking dataframe info
customers_df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 206209 entries, 0 to 206208
Data columns (total 10 columns):
 #   Column          Non-Null Count   Dtype
---  ------          --------------   -----
 0   user_id         206209 non-null  int64
 1   first_name      194950 non-null  object
 2   last_name       206209 non-null  object
 3   gender          206209 non-null  object
 4   state           206209 non-null  object
 5   age             206209 non-null  int64
 6   date_joined     206209 non-null  object
 7   num_dependants  206209 non-null  int64
 8   fam_status      206209 non-null  object
 9   income          206209 non-null  int64
dtypes: int64(4), object(6)
memory usage: 15.7+ MB

In [21]:
# Checking descriptive anaysis for customers dataset
customers_df2.describe()

             user_id            age  num_dependants         income
count  206209.000000  206209.000000   206209.000000  206209.000000
mean   103105.000000      49.501646        1.499823   94632.852548
std     59527.555167      18.480962        1.118433   42473.786988
min         1.000000      18.000000        0.000000   25903.000000
25%     51553.000000      33.000000        0.000000   59874.000000
50%    103105.000000      49.000000        1.000000   93547.000000
75%    154657.000000      66.000000        3.000000  124244.000000
max    206209.000000      81.000000        3.000000  593901.000000

### Question 5. Complete the fundamental data quality and consistency checks you've learned throughout this Achievement; for example, check for and address missing values and duplicates, and convert any mixed -type data.

In [22]:
# Checking for Missing Values
customers_df2.isnull().sum()

user_id               0
first_name        11259
last_name             0
gender                0
state                 0
age                   0
date_joined           0
num_dependants        0
fam_status            0
income                0
dtype: int64

In [23]:
# Create subset of dataframe containing missing value 'first_name'
df_nan = customers_df2[customers_df2['first_name'].isnull() ==True]

In [24]:
# Visualizing missing data
df_nan

,user_id,first_name,last_name,gender,state,age,date_joined,num_dependants,fam_status,income
53,76659,NaN,Gilbert,Male,Colorado,26,1/1/2017,2,married,41709
73,13738,NaN,Frost,Female,Louisiana,39,1/1/2017,0,single,82518
82,89996,NaN,Dawson,Female,Oregon,52,1/1/2017,3,married,117099
99,96166,NaN,Oconnor,Male,Oklahoma,51,1/1/2017,1,married,155673
105,29778,NaN,Dawson,Female,Utah,63,1/1/2017,3,married,151819
...,...,...,...,...,...,...,...,...,...,...
206038,121317,NaN,Melton,Male,Pennsylvania,28,3/31/2020,3,married,87783
206044,200799,NaN,Copeland,Female,Hawaii,52,4/1/2020,2,married,108488
206090,167394,NaN,Frost,Female,Hawaii,61,4/1/2020,1,married,45275
206162,187532,NaN,Floyd,Female,California,39,4/1/2020,0,single,56325
206171,116898,NaN,Delgado,Female,Colorado,23,4/1/2020,2,married,59222

In [25]:
# Compare the number of rows in current dataframe
customers_df2.shape

(206209, 10)

In [26]:
# Create new dataframe
customers_df2_clean = customers_df[customers_df2['first_name'].isnull() == False]

In [27]:
# Checking number of rows in new dataframe
customers_df2_clean.shape

(194950, 10)

In [28]:
customers_df2_clean.head()

,user_id,first_name,last_name,gender,state,age,date_joined,num_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

In [30]:
# Checking for Duplicates
df_dups = customers_df2_clean[customers_df2_clean.duplicated()]

In [31]:
# Checking results,
df_dups

Empty DataFrame
Columns: [user_id, first_name, last_name, gender, state, age, date_joined, num_dependants, fam_status, income]
Index: []

#### No duplicates found

In [33]:
# Checking whether dataframe contains mixed-type data
for col in customers_df2_clean.columns.tolist():
    weird = (customers_df2_clean[[col]].applymap(type) != customers_df2_clean[[col]].iloc[0].apply(type)).any(axis = 1)
    if len (customers_df2_clean[weird]) > 0:
        print (col)

#### No mixed-type data found.

### Question 6. Combine your customer data with the rest of your prepared Instacart data.

In [34]:
# Import ords_prods_merged dataset
df_ords_prods_merged = pd.read_pickle(os.path.join(path, '02 Data', 'Prepared Data', 'orders_products_merged_v5.pkl'))

In [35]:
df_ords_prods_merged.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 32406041 entries, 0 to 32406040
Data columns (total 25 columns):
 #   Column                  Dtype
---  ------                  -----
 0   order_id                int64
 1   user_id                 int64
 2   eval_set                object
 3   order_number            int64
 4   orders_day_of_week      int64
 5   orders_time_of_day      int64
 6   days_since_prior_order  float64
 7   product_id              int64
 8   add_to_cart_order       int64
 9   reordered               int64
 10  product_name            object
 11  aisle_id                int64
 12  department_id           int64
 13  prices                  float64
 14  _merge                  category
 15  price_range_loc         object
 16  busiest_day             object
 17  busiest_days            object
 18  busiest_period_of_day   object
 19  max_order               int64
 20  loyalty_flag            object
 21  avg_price               float64
 22  spending_flag           object
 23  median_prior_orders     float64
 24  frequency_flag          object
dtypes: category(1), float64(4), int64(11), object(9)
memory usage: 6.1+ GB

In [41]:
# dropping the merge column
df_ords_prods_merged = df_ords_prods_merged.drop(columns = ['_merge'])

In [42]:
df_ords_prods_merged.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 32406041 entries, 0 to 32406040
Data columns (total 24 columns):
 #   Column                  Dtype
---  ------                  -----
 0   order_id                int64
 1   user_id                 int64
 2   eval_set                object
 3   order_number            int64
 4   orders_day_of_week      int64
 5   orders_time_of_day      int64
 6   days_since_prior_order  float64
 7   product_id              int64
 8   add_to_cart_order       int64
 9   reordered               int64
 10  product_name            object
 11  aisle_id                int64
 12  department_id           int64
 13  prices                  float64
 14  price_range_loc         object
 15  busiest_day             object
 16  busiest_days            object
 17  busiest_period_of_day   object
 18  max_order               int64
 19  loyalty_flag            object
 20  avg_price               float64
 21  spending_flag           object
 22  median_prior_orders     float64
 23  frequency_flag          object
dtypes: float64(4), int64(11), object(9)
memory usage: 6.0+ GB

In [43]:
df_ords_prods_merged['order_id']=df_ords_prods_merged['order_id'].astype('int32')

In [44]:
df_ords_prods_merged['order_number']=df_ords_prods_merged['order_number'].astype('int32')

In [45]:
df_ords_prods_merged['days_since_prior_order']=df_ords_prods_merged['days_since_prior_order'].astype('float16')

In [46]:
df_ords_prods_merged['orders_day_of_week']=df_ords_prods_merged['orders_day_of_week'].astype('int8')

In [47]:
df_ords_prods_merged.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 32406041 entries, 0 to 32406040
Data columns (total 24 columns):
 #   Column                  Dtype
---  ------                  -----
 0   order_id                int32
 1   user_id                 int64
 2   eval_set                object
 3   order_number            int32
 4   orders_day_of_week      int8
 5   orders_time_of_day      int64
 6   days_since_prior_order  float16
 7   product_id              int64
 8   add_to_cart_order       int64
 9   reordered               int64
 10  product_name            object
 11  aisle_id                int64
 12  department_id           int64
 13  prices                  float64
 14  price_range_loc         object
 15  busiest_day             object
 16  busiest_days            object
 17  busiest_period_of_day   object
 18  max_order               int64
 19  loyalty_flag            object
 20  avg_price               float64
 21  spending_flag           object
 22  median_prior_orders     float64
 23  frequency_flag          object
dtypes: float16(1), float64(3), int32(2), int64(8), int8(1), object(9)
memory usage: 5.4+ GB

In [50]:
customers_df2_clean.info()

<class 'pandas.core.frame.DataFrame'>
Index: 194951 entries, 0 to user_id
Data columns (total 10 columns):
 #   Column          Non-Null Count   Dtype
---  ------          --------------   -----
 0   user_id         194950 non-null  object
 1   first_name      194950 non-null  object
 2   last_name       194950 non-null  object
 3   gender          194950 non-null  object
 4   state           194950 non-null  object
 5   age             194950 non-null  float64
 6   date_joined     194950 non-null  object
 7   num_dependants  194950 non-null  float64
 8   fam_status      194950 non-null  object
 9   income          194950 non-null  float64
dtypes: float64(3), object(7)
memory usage: 16.4+ MB

In [54]:
df_ords_prods_merged['user_id']=df_ords_prods_merged['user_id'].astype('str')

In [55]:
df_ords_prods_merged.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 32406041 entries, 0 to 32406040
Data columns (total 24 columns):
 #   Column                  Dtype
---  ------                  -----
 0   order_id                int32
 1   user_id                 object
 2   eval_set                object
 3   order_number            int32
 4   orders_day_of_week      int8
 5   orders_time_of_day      int64
 6   days_since_prior_order  float16
 7   product_id              int64
 8   add_to_cart_order       int64
 9   reordered               int64
 10  product_name            object
 11  aisle_id                int64
 12  department_id           int64
 13  prices                  float64
 14  price_range_loc         object
 15  busiest_day             object
 16  busiest_days            object
 17  busiest_period_of_day   object
 18  max_order               int64
 19  loyalty_flag            object
 20  avg_price               float64
 21  spending_flag           object
 22  median_prior_orders     float64
 23  frequency_flag          object
dtypes: float16(1), float64(3), int32(2), int64(7), int8(1), object(10)
memory usage: 5.4+ GB

In [56]:
df_merged_clean = customers_df2_clean.merge(df_ords_prods_merged, on = 'user_id', indicator = True)

In [57]:
df_merged_clean.head()

,user_id,first_name,last_name,gender,state,age,date_joined,num_dependants,fam_status,income,...,busiest_day,busiest_days,busiest_period_of_day,max_order,loyalty_flag,avg_price,spending_flag,median_prior_orders,frequency_flag,_merge
0,26711,Deborah,Esquivel,Female,Missouri,48.0,1/1/2017,3.0,married,165665.0,...,Regularly busy,Busiest days,Most Orders,8,New customer,7.988889,Low spender,19.0,Regular customer,both
1,26711,Deborah,Esquivel,Female,Missouri,48.0,1/1/2017,3.0,married,165665.0,...,Regularly busy,Regularly busy days,Most Orders,8,New customer,7.988889,Low spender,19.0,Regular customer,both
2,26711,Deborah,Esquivel,Female,Missouri,48.0,1/1/2017,3.0,married,165665.0,...,Regularly busy,Busiest days,Most Orders,8,New customer,7.988889,Low spender,19.0,Regular customer,both
3,26711,Deborah,Esquivel,Female,Missouri,48.0,1/1/2017,3.0,married,165665.0,...,Regularly busy,Regularly busy days,Most Orders,8,New customer,7.988889,Low spender,19.0,Regular customer,both
4,26711,Deborah,Esquivel,Female,Missouri,48.0,1/1/2017,3.0,married,165665.0,...,Regularly busy,Slowest days,Most Orders,8,New customer,7.988889,Low spender,19.0,Regular customer,both

In [59]:
# Export data
df_merged_clean.to_pickle(os.path.join(path, '02 Data','Prepared Data','orders_products_customers_merged.pkl'))